# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
#brew 'zsh'
#brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
#brew 'awscli'
brew 'python'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'node'
brew 'trash'
brew 'wget'
#brew 'httpie'

# Development
#brew 'php56'
brew 'php70', args: ['with-debug', 'without-apache']
#brew 'php71', args: ['with-debug', 'without-apache']
brew link php70
brew 'homebrew/php/php70-mcrypt'
brew 'homebrew/php/php70-imagick'
brew 'homebrew/php/php70-redis'
brew 'homebrew/php/php-cs-fixer'
brew 'mariadb'

# Apps
cask 'alfred'
cask 'avast'
cask 'dash'
cask 'flux'
cask 'lastpass'
cask 'rescuetime'
cask 'spotify'
cask 'spectacle'
cask 'toggldesktop'
cask 'vlc'
cask 'utorrent'
cask 'callnote-premium'
# Files & Storage
cask 'dropbox'
cask 'google-drive'
cask 'filezilla'
cask 'cornerstone'
cask 'sourcetree'
cask 'the-unarchiver'
# Browsers
cask 'onedrive'
cask 'firefox'
cask 'google-chrome'
cask 'opera'
# Communication
cask 'skype'
cask 'slack'
cask 'whatsapp'
cask 'google-hangouts'
cask 'microsoft-lync'
cask 'microsoft-lync-plugin'
# Editors
cask 'atom'
cask 'phpstorm'
cask 'sublime-text3'
cask 'adobe-creative-cloud'
# DevTools
cask 'mysqlworkbench'
cask 'sequel-pro'
cask 'poedit'
cask 'sketch'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'vagrant-manager'
cask 'iterm2'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'webpquicklook'
cask 'betterzipql'
cask 'qlimagesize'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
