tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'


brew "aws-elasticbeanstalk", link: false
brew "python"
brew "python@2"
brew "awscli"
brew "bash"
brew "bat"
brew "coreutils"
brew "dnsmasq", restart_service: true
brew "elasticsearch", restart_service: true
brew "findutils"
brew "git"
brew "grep"
brew "highlight"
brew "httpie"
brew "hub"
brew "icu4c"
brew "jenv"
brew "libidn2"
brew "mackup"
brew "mariadb", restart_service: true
brew "mas"
brew "nginx", restart_service: true
brew "node"
brew "php", restart_service: true
brew "pho@7.1"
brew 'php-cs-fixer'
brew 'phpunit'
brew 'mysql@5.7'
brew "trash"
brew "tree"
brew "wget"
brew "wp-cli"
brew "yarn"
cask "adobe-creative-cloud"
cask "alfred"
cask "betterzipql"
cask "dropbox"
cask "filezilla"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "google-chrome"
cask "google-backup-and-sync"
cask "google-hangouts"
cask "java"
cask "java8"
cask "lastpass"
cask "onedrive"
cask "opera"
cask "jetbrains-toolbox"
cask "poedit"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "the-unarchiver"
cask "toggldesktop"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "whatsapp"
mas "Affinity Designer", id: 824171161
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Pocket", id: 568494494
mas "Trello", id: 1278508951
mas "TweetDeck", id: 485812721
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
